<?php
/**
 *	@DESC 将dianciapu首页城市列表采集出来
 *	@date 2014-01-15
*/
ignore_user_abort();
set_time_limit(0);
header("content-type:text/html;charset=utf-8");
/*$html	= file_get_contents('catch_txt/diancaipu.txt');

// <a href='http://www.diancaipu.com/41/' title='鞍山订餐网'>鞍山</a>
echo '<pre>';
$pattern	= '/<a href=\'http\:\/\/www\.diancaipu\.com\/(\d*)?\/\' title=\'([^>]*?)?\'>(?<city_name2>[^<]*?)?<\/a>/im';
preg_match_all($pattern, $html, $matches, PREG_SET_ORDER);
if(is_array($matches))
{
	$city	= array();
	foreach ($matches as $key => $value)
	{
		$city[$value[1]]	= $value['city_name2'];
	}
	sort($city);
	echo var_export($city, true);
}*/

$city	= array (  0 => '七台河',  1 => '万宁',  2 => '三亚',  3 => '三明',  4 => '三门峡',  5 => '上海',  6 => '上饶',  7 => '东方',  8 => '东莞',  9 => '东营',  10 => '中卫',  11 => '中山',  12 => '临夏',  13 => '临汾',  14 => '临沂',  15 => '临沧',  16 => '丹东',  17 => '丽水',  18 => '丽江',  19 => '乌兰察布',  20 => '乌海',  21 => '乌鲁木齐',  22 => '乐山',  23 => '九江',  24 => '云浮',  25 => '五指山',  26 => '亳州',  27 => '仙桃',  28 => '伊春',  29 => '佛山',  30 => '佳木斯',  31 => '保定',  32 => '保山',  33 => '信阳',  34 => '儋州',  35 => '克拉玛依',  36 => '六安',  37 => '六盘水',  38 => '兰州',  39 => '兴安盟',  40 => '内江',  41 => '凉山',  42 => '包头',  43 => '北京',  44 => '北海',  45 => '十堰',  46 => '南京',  47 => '南充',  48 => '南宁',  49 => '南平',  50 => '南昌',  51 => '南通',  52 => '南阳',  53 => '厦门',  54 => '双鸭山',  55 => '台州',  56 => '合肥',  57 => '吉安',  58 => '吉林',  59 => '吕梁',  60 => '吴忠',  61 => '周口',  62 => '呼伦贝尔',  63 => '呼和浩特',  64 => '咸宁',  65 => '咸阳',  66 => '哈尔滨',  67 => '唐山',  68 => '商丘',  69 => '商洛',  70 => '嘉兴',  71 => '嘉峪关',  72 => '四平',  73 => '固原',  74 => '大兴安岭',  75 => '大同',  76 => '大庆',  77 => '大理',  78 => '大连',  79 => '天水',  80 => '天津',  81 => '天门',  82 => '太原',  83 => '威海',  84 => '娄底',  85 => '孝感',  86 => '宁德',  87 => '宁波',  88 => '安庆',  89 => '安康',  90 => '安阳',  91 => '安顺',  92 => '定西',  93 => '宜宾',  94 => '宜昌',  95 => '宜春',  96 => '宝鸡',  97 => '宣城',  98 => '宿州',  99 => '宿迁',  100 => '崇左',  101 => '巢湖',  102 => '巴中',  103 => '巴彦淖尔',  104 => '常州',  105 => '常德',  106 => '平凉',  107 => '平顶山',  108 => '广元',  109 => '广安',  110 => '广州',  111 => '庆阳',  112 => '廊坊',  113 => '延安',  114 => '延边',  115 => '开封',  116 => '张家口',  117 => '张家界',  118 => '张掖',  119 => '徐州',  120 => '德宏',  121 => '德州',  122 => '德阳',  123 => '忻州',  124 => '怀化',  125 => '怒江',  126 => '思茅',  127 => '恩施',  128 => '惠州',  129 => '成都',  130 => '扬州',  131 => '承德',  132 => '抚州',  133 => '抚顺',  134 => '拉萨',  135 => '揭阳',  136 => '攀枝花',  137 => '文山',  138 => '文昌',  139 => '新乡',  140 => '新余',  141 => '无锡',  142 => '日照',  143 => '昆明',  144 => '昭通',  145 => '晋中',  146 => '晋城',  147 => '景德镇',  148 => '曲靖',  149 => '朔州',  150 => '朝阳',  151 => '本溪',  152 => '来宾',  153 => '杭州',  154 => '松原',  155 => '枣庄',  156 => '柳州',  157 => '株洲',  158 => '桂林',  159 => '梅州',  160 => '梅河口',  161 => '梧州',  162 => '楚雄',  163 => '榆林',  164 => '武威',  165 => '武汉',  166 => '永州',  167 => '汉中',  168 => '汕头',  169 => '汕尾',  170 => '江门',  171 => '池州',  172 => '沈阳',  173 => '沧州',  174 => '河池',  175 => '河源',  176 => '泉州',  177 => '泰安',  178 => '泰州',  179 => '泸州',  180 => '洛阳',  181 => '济南',  182 => '济宁',  183 => '海口',  184 => '淄博',  185 => '淮北',  186 => '淮南',  187 => '淮安',  188 => '深圳',  189 => '清远',  190 => '温州',  191 => '渭南',  192 => '湖州',  193 => '湘潭',  194 => '湘西',  195 => '湛江',  196 => '滁州',  197 => '滨州',  198 => '漯河',  199 => '漳州',  200 => '潍坊',  201 => '潜江',  202 => '潮州',  203 => '澳门',  204 => '濮阳',  205 => '烟台',  206 => '焦作',  207 => '牡丹江',  208 => '玉林',  209 => '玉溪',  210 => '珠海',  211 => '琼海',  212 => '甘南',  213 => '甘孜',  214 => '白城',  215 => '白山',  216 => '白银',  217 => '百色',  218 => '益阳',  219 => '盐城',  220 => '盘锦',  221 => '眉山',  222 => '石嘴山',  223 => '石家庄',  224 => '神农架',  225 => '福州',  226 => '秦皇岛',  227 => '红河',  228 => '绍兴',  229 => '绥化',  230 => '绵阳',  231 => '聊城',  232 => '肇庆',  233 => '自贡',  234 => '舟山',  235 => '芜湖',  236 => '苏州',  237 => '茂名',  238 => '荆州',  239 => '荆门',  240 => '荷泽',  241 => '莆田',  242 => '莱芜',  243 => '萍乡',  244 => '营口',  245 => '葫芦岛',  246 => '蚌埠',  247 => '衡水',  248 => '衡阳',  249 => '衢州',  250 => '襄樊',  251 => '西宁',  252 => '西安',  253 => '许昌',  254 => '贵港',  255 => '贵阳',  256 => '贺州',  257 => '资阳',  258 => '赣州',  259 => '赤峰',  260 => '辽源',  261 => '辽阳',  262 => '达州',  263 => '运城',  264 => '连云港',  265 => '迪庆',  266 => '通化',  267 => '通辽',  268 => '遂宁',  269 => '遵义',  270 => '邢台',  271 => '邯郸',  272 => '邵阳',  273 => '郑州',  274 => '郴州',  275 => '鄂尔多斯',  276 => '鄂州',  277 => '酒泉',  278 => '重庆',  279 => '金华',  280 => '金昌',  281 => '钦州',  282 => '铁岭',  283 => '铜仁',  284 => '铜川',  285 => '铜陵',  286 => '银川',  287 => '锡林郭勒盟',  288 => '镇江',  289 => '长春',  290 => '长沙',  291 => '长治',  292 => '阜新',  293 => '阜阳',  294 => '防城港',  295 => '阳江',  296 => '阳泉',  297 => '阿坝',  298 => '阿拉善盟',  299 => '陇南',  300 => '随州',  301 => '雅安',  302 => '青岛',  303 => '鞍山',  304 => '韶关',  305 => '马鞍山',  306 => '驻马店',  307 => '鸡西',  308 => '鹤壁',  309 => '鹤岗',  310 => '鹰潭',  311 => '黄冈',  312 => '黄山',  313 => '黄石',  314 => '黑河',  315 => '齐齐哈尔',  316 => '龙岩');


$list_url	= 'http://www.diancaipu.com/list-%s-1-%s-1.html';
$cate	= 7;
/*foreach ($city as $city_id => $city_name)
{
	for ($i=1; $i <= $cate; $i++)
	{ 
		$url	= sprintf($list_url, $city_id, $i);
		$html	= getHtml($url);
		echo $html;
		exit();
	}
}*/
echo '<pre>';
error_reporting(E_ALL);
$detail_url	= 'http://www.diancaipu.com/company-%s-%s.html';
$html	= file_get_contents('catch_txt/diancaipu_content.txt');
getContent($html);
function getContent($html)
{
	// 商户名
	$pattern	= '/<a style="text\-decoration\: none;" href="(.*)?\.html" title=\'(?<name_a>[^>]*)?\'\>(?<name_r>[^<]*)?<\/a>/im';
	preg_match_all($pattern, $html, $match_name);
	if(isset($match_name['name_r'][0]) && $match_name['name_r'][0])
	{
		$shop_name	= $match_name['name_r'][0];
	}

	// 地址		<div style="padding-left:6px;width:700px; float:left; font-size:14px;height:20px; line-height:20px;"> 地址：北京市东城区珠市口东大街11号</div>
	$pattern	= '/地址：(?<addr>[^<]*)?/im';
	preg_match_all($pattern, $html, $match_address);
	if(isset($match_address['addr'][0]) && $match_address['addr'][0])
	{
		$shop_addr	= $match_address['addr'][0];
	}

	//人均消费	人均消费：</span><span style="color:#FF0000; size:14px;">80-100元</span><br />
	$pattern	= '/人均消费：<\/span><span (?<no>[^>]*)?>(?<cons>[^<]*)?<\/span>/im';
	preg_match_all($pattern, $html, $match_cons);
	if(isset($match_cons['cons'][0]) && $match_cons['cons'][0])
	{
		$shop_cons	= $match_cons['cons'][0];
	}

	// 环境	<span style="font-size:14px;">餐厅环境：</span><span style="color:#3366FF">优雅 时尚 高档</span>
	$pattern	= '/餐厅环境：<\/span><span (?<no>[^>]*)?>(?<envi>[^<]*)?<\/span>/im';
	preg_match_all($pattern, $html, $match_envi);
	if(isset($match_envi['envi'][0]) && $match_envi['envi'][0])
	{
		$shop_envi	= $match_envi['envi'][0];
	}

	// 标签（特色）	<span style="font-size:14px;">餐厅特色：</span>川菜<br>
	$pattern	= '/餐厅特色：<\/span>(?<tese>[^<]*)?/im';
	preg_match_all($pattern, $html, $match_tese);
	if(isset($match_tese['tese'][0]) && $match_tese['tese'][0])
	{
		$shop_tese	= $match_tese['tese'][0];
	}

	// 菜谱数据
	
	

var_dump('商户名称：'.$shop_name);
var_dump('商户地址：'.$shop_addr);
var_dump('人均消费：'.$shop_cons);
var_dump('餐厅环境：'.$shop_envi);
var_dump('餐厅特色：'.$shop_tese);
}


